tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "caskroom/drivers"
# Add manually installed formula
cask "fs-uae"
brew "composer"
brew "git"
brew "make"
brew "mtr"
brew "trash"
brew "fish"
brew "httpie"
brew "jq"
brew "bat"
brew "mas"
brew "maven"
brew "packer"
brew "reattach-to-user-namespace"
cask "the-unarchiver"
brew "terraform"
brew "tmux"
brew "ffmpeg"
brew "unbound", restart_service: false
brew "rbenv"
brew "tox"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pipenv"
brew "gradle"
brew "sbt"
brew "scala"
brew "xhyve"
# nmap network scanner
brew "nmap"
cask "viscosity"
brew "pandoc"
cask "skim"
brew "serverless"
brew "awscli"
brew "kubectl"
brew "ansible"
brew "jfrog-cli-go"
cask "docker"
cask "iterm2"
cask "sublime-text"
cask "intellij-idea"
cask "rubymine"
brew "ipython"
cask "pycharm"
cask "webstorm"
brew "npm"
cask "clion"
cask "visual-studio-code"
cask "ngrok"
brew "graphviz"
# Actual brewing
cask "beersmith"
# CI development
brew "groovysdk"
brew "jenkins"
cask "anki"
# Messaging
cask "signal"
cask "discord"
cask "zoomus"
# HODL
tap "paritytech/paritytech"
# Manual upgrade for Cardano 1.2
cask "daedalus"
brew "parity"
cask "electron-cash"
cask "ethereum-wallet"
cask "stargazer"
# Typography, bitch!
cask "font-anonymous-pro"
# Fun stuff
brew "lolcat"
cask "the-ur-quan-masters"
# More creative
cask "appcode"
cask "unity-hub"
brew "mono"
cask "dotnet-sdk"
brew "git-lfs"
cask "freecad"
cask "blender"
cask "sketchup"
cask "gimp"
cask "darktable"
cask "imageoptim"
# Drivers
cask "wacom-tablet"
# FIXME: Has been manually installed (alpha)
# cask "xbox360-controller-driver-unofficial"
cask "webpquicklook"
mas "Autodesk SketchBook", id: 863486266
cask "handbrake"
# 1337 scene shit
cask "dosbox"
cask "vlc"
# Browser for using Hangouts
cask "brave-browser"
brew "qt"
# Evaluating 30-day trial
# mas "Pixelmator Pro", id: 1289583905
# App store
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
mas "Microsoft Remote Desktop 10", id: 1295203466
cask "vnc-viewer"
mas "Pocket", id: 568494494
# For DVI-to-PDF
cask "mactex"
cask "libreoffice"
# Useful build dependencies
brew "openssl"
brew "readline"
brew "zlib"
# gettext is used by some autocompletions, pyenv stubs can get in the way here
brew "gettext"
# Music/transcoding stuff?
cask "xld"
