tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/drivers"
brew "fish"
brew "httpie"
brew "jq"
brew "mas"
brew "maven"
brew "packer"
brew "reattach-to-user-namespace"
brew "terraform"
brew "tmux"
brew "ffmpeg"
brew "unbound", restart_service: true
brew "rbenv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pipenv"
brew "xhyve"
# nmap network scanner
brew "nmap"
cask "viscosity"
brew "pandoc"
brew "awscli"
brew "kubectl"
brew "ansible"
brew "jfrog-cli-go"
cask "docker"
cask "iterm2"
cask "sublime-text"
cask "intellij-idea"
cask "rubymine"
cask "pycharm"
cask "webstorm"
brew "npm"
cask "clion"
cask "visual-studio-code"
cask "ngrok"
brew "graphviz"
# CI development
brew "groovysdk"
brew "jenkins"
cask "anki"
# Messaging
cask "signal"
# HODL
tap "paritytech/paritytech"
# Manual upgrade for Cardano 1.2
cask "daedalus"
brew "parity"
cask "electron-cash"
cask "ethereum-wallet"
cask "stargazer"
# Typography, bitch!
cask "font-anonymous-pro"
# Fun stuff
brew "lolcat"
cask "the-ur-quan-masters"
# More creative
cask "appcode"
cask "unity"
brew "mono"
cask "dotnet-sdk"
brew "git-lfs"
cask "freecad"
cask "blender"
cask "sketchup"
cask "gimp"
cask "imageoptim"
cask "wacom-intuos-tablet"
mas "Autodesk SketchBook", id: 863486266
# 1337 scene shit
cask "dosbox"
cask "vlc"
brew "qt"
# Evaluating 30-day trial
# mas "Pixelmator Pro", id: 1289583905
# App store
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
mas "Microsoft Remote Desktop 10", id: 1295203466
mas "Pocket", id: 568494494
# Useful build dependencies
brew "openssl"
brew "readline"
brew "zlib"
# gettext is used by some autocompletions, pyenv stubs can get in the way here
brew "gettext"
# Music/transcoding stuff?
cask "xld"
