tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/cask"
tap "caskroom/fonts"
brew "fish"
brew "httpie"
brew "jq"
brew "mas"
brew "maven"
brew "packer"
brew "reattach-to-user-namespace"
brew "terraform"
brew "tmux"
brew "unbound", restart_service: true
brew "rbenv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "xhyve"
# nmap network scanner
brew "nmap"
brew "pandoc"
brew "awscli"
brew "kubectl"
brew "ansible"
# Fun
brew "lolcat"
cask "docker"
cask "iterm2"
cask "sublime-text"
cask "intellij-idea"
cask "rubymine"
cask "phpstorm"
cask "pycharm"
cask "clion"
cask "visual-studio-code"
cask "ngrok"
cask "stargazer"
cask "anki"
cask "gpg-suite"
# HODL
# Manual upgrade for Cardano 1.2
# cask "daedalus"
cask "electron-cash"
cask "ethereum-wallet"
# Typography, bitch!
cask "font-anonymous-pro"
# Fun stuff
cask "the-ur-quan-masters"
# More creative
cask "unity"
brew "mono"
cask "dotnet-sdk"
cask "freecad"
cask "blender"
cask "sketchup"
cask "gimp"
# Evaluating 30-day trial
# mas "Pixelmator Pro", id: 1289583905
# App store
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
mas "Microsoft Remote Desktop 8.0", id: 715768417
mas "Pocket", id: 568494494
# Useful build dependencies
brew "openssl"
brew "readline"
# gettext is used by some autocompletions, pyenv stubs can get in the way here
brew "gettext"
